app/controllers/categories_controller.rb

INSERT INTO "categories" ("updated_at", "name", "description", "created_at") VALUES('2022-01-23 09:43:59', 'category abc', 'fake data', '2022-01-23 09:43:59')
---
    def create
        @category = Category.new(params[:category])
        if @category.save

UPDATE "categories" SET "updated_at" = '2022-01-23 12:52:13', "description" = 'avd', "name" = 'xyz' WHERE "id" = 1
---
    def update
        if @category.update_attributes(params[:category])

DELETE FROM "categories" WHERE "id" = 1
---
    def destroy
        if @category.destroy

SELECT * FROM "categories" WHERE ("categories"."id" = 70057713819600)
---
     def set_category
        @category = Category.find(params[:id])