app/controllers/posts_controller.rb

    def create
        @post = Post.new(params[:post])
        if @post.save
---
INSERT INTO "posts" ("updated_at", "title", "category_id", "created_at", "content") VALUES('2022-01-24 03:42:44', 'test factory girl', NULL, '2022-01-24 03:42:44', 'fake data')

    def update
        if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "content" = 'vui vẻ', "updated_at" = '2022-01-24 02:37:04' WHERE "id" = 2

    def destroy
        if @post.destroy
---
DELETE FROM "posts" WHERE "id" = 1

     def set_post
        @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)